app/Controllers/post.php

INSERT INTO `artikel` (`judul`, `isi`) VALUES ('Seblak', 'Pedes')
---
public function create()
{
        $model = new ArtikelModel();
        $data = [
            'judul' => $this->request->getVar('judul'),
            'isi' => $this->request->getVar('isi'),
        ];
        $model->insert($data);

SELECT *
FROM `artikel`
WHERE `id` = '19'
 LIMIT 1
---
public function show($id = null)
{
        $model = new ArtikelModel();
        $data = $model->where('id', $id)->first();

DELETE FROM `artikel`
WHERE `id` = '19'
AND `id` IN ('19')
DELETE FROM `artikel`
WHERE `id` IN ('19')
---
    public function delete($id = null)
    {
    $model = new ArtikelModel();
    $data = $model->where('id', $id)->delete($id);
    if ($data) {
    $model->delete($id);